[
  {
    "header": "Historic LNG Sale",
    "img": "https://scontent.fmel3-1.fna.fbcdn.net/v/t39.30808-6/438198177_403206955804008_1876919180292136905_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=5f2048&_nc_ohc=gyqRToWXNxkAb69OBv1&_nc_ht=scontent.fmel3-1.fna&oh=00_AfCilq_sApz0YA4W33Kyugjrje_-IDeVWQlRnoskBNhANg&oe=6626A07B",
    "text": "Kumul Petroleum begins direct LNG sales, marks industry milestone.",
    "content": "Kumul Petroleum Holdings Limited has made a groundbreaking move by directly marketing liquefied natural gas (LNG) on the 'spot' market from its share of products from the PNG LNG Gas Project.\n\nThis marks the first time the company has ventured into direct sales of LNG that was not committed to long-term sales agreements.\n\nFollowing a tender process held in February, Kumul Petroleum has confirmed a deal to sell 144,000 cubic meters of LNG on Free On Board (FOB) terms to PetroChina International Corporation Limited.\n\nThe LNG is currently being loaded onto the Wudang vessel at the PNG LNG Project wharf at Caution Bay.\n\nSpecial guests present to witness this event were Deputy Prime Minister John Rosso, PCSG PETROL China Managing Director Li Shaolin, Minister for State Enterprises William Duma, KPHL Managing Director Wapu Sonk and ExxonMobil PNG Managing Director Chairperson Tera Shandro.\n\nMr Sonk expressed the significance of this milestone, emphasizing that it signifies Kumul Petroleum's ability to market its equity share of LNG production from the PNG LNG Project beyond the confines of long-term sales agreements.\n\nWith a 16.77 percent share in the project, Kumul Petroleum is poised to sell approximately 14 LNG cargoes over the next four years. Additionally, discussions are underway to acquire an additional 2.6 percent of the project, further bolstering their capacity to sell LNG on the spot market.\n\nSonk highlighted the importance of this achievement for both Kumul Petroleum and the country, signalling a new era of direct involvement in LNG marketing. The company is actively engaged in negotiations with other potential buyers, indicating a promising future for direct LNG sales from PNG."
  },
  {
    "header": "US Visitor Visa Extension",
    "img": "https://scontent.fmel3-1.fna.fbcdn.net/v/t39.30808-6/437777558_403170045807699_4571279528831346689_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=5f2048&_nc_ohc=BPSa1v7m3IwAb5K6gPM&_nc_ht=scontent.fmel3-1.fna&oh=00_AfANqtOpVddGaVyDaSd0VRnFDqyFHp7BCxRkPdiZwA08kA&oe=6626A72B",
    "text": "US extends visitor visa duration for PNG citizens to six months.",
    "content": "Effective April 17, 2024, the U.S. Embassy has announced a significant revision in visa regulations for Papua New Guinean citizens travelling to the United States.\n\n    Previously, visitor visas (B-1/B-2 visas) for Papua New Guineans allowed only a maximum stay of one month with a single entry. However, under the new guidelines, these visas will now permit a maximum stay of six months with single entry.\n\nThis adjustment is a part of the revised visa reciprocity schedule and is set to greatly benefit Papua New Guineans intending to visit the United States. It allows them the flexibility to plan their visits well in advance, facilitating activities such as visiting family, attending conferences, and engaging in tourism.\n\nFurthermore, the update will streamline the visa application process, enabling applicants to schedule their visa interviews more than a month ahead of their intended travel dates.\n\nThis change is particularly significant for the consular section of the U.S. Embassy in Port Moresby, as it will alleviate scheduling constraints and enhance efficiency in visa processing.\n\nIt's important to note that while 12-month, multiple-entry visas remain an option for qualified short-term business (B-1) visa applicants for an additional fee, they are no longer available for tourist (B-2) visa applicants as of April 17, 2024.\n\nFor more detailed information regarding these revisions and the revised visa reciprocity schedule, individuals are encouraged to visit travel.state.gov.\n\nThe Department of State emphasizes that through these visa services, it aims to promote travel and tourism, facilitate regulated labour flow, support business travel and investment, safeguard national security, and contribute to key U.S. economic sectors while also sustaining numerous jobs across the nation. "
  },
  {
    "header": "Sinai challenges warrant of arrest",
    "img": "https://scontent.fmel3-1.fna.fbcdn.net/v/t39.30808-6/438204790_402742835850420_8081035891994118149_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=5f2048&_nc_ohc=uO8ggibwRBcAb5iTdo3&_nc_ht=scontent.fmel3-1.fna&oh=00_AfC2saKNMx2bdHrI_Hi52CI_DANtFa8gKQSZr7iD8b5lvw&oe=6626A226",
    "text": "Electoral Commissioner Sinai contests arrest warrant legality in court.",
    "content": "On Monday, the 15th of April, the Electoral Commissioner Simon Sinai applied to the Supreme Court to challenge the legality of a warrant of arrest issued against him. \n\nHis application was filed under section 57 of the Constitution, which states to protect him from being arrested or intimidated until they verify the legality of the warrant of arrest issued against him by the Chief Magistrate of the District Court on February 21, 2024.\n\nAccording to his lawyer Michael John, the warrant of arrest was based on the allegations of abuse of office in relation to his conduct in accepting the writ for Dei Open in the 2022 National General Election.\n\nWhen mentioning the case John had sought the Courts permission to give them time for the Electoral Commissioner to file an affidavit in support as the Sinai was out of the country. \n\nSinai’s lawyer argued that the Warrant of Arrest should be issued by the Police Commissioner, David Manning and the sensitive board, and not the chief magistrate.\n\n“We haven’t got any confirmation that such approval has been given to the police to peruse this matter or not,” John said.\n\nMeanwhile, Justice David Cannings when issuing the direction on the application ordered that three different state agencies must be named in the application, because the current application did not contain the agencies, rather it was filed under section 57 of the constitution.\n\nCannings said the agencies are, the Public Prosecutor, the State, and the Police Commissioner David Manning, they are to be named as respondents in the matter as it was a unique matter.\n\nThe matter returns to court on May 6th."
  },
  {
    "header": "Erima Village embraces footbridge",
    "img": "https://scontent.fmel3-1.fna.fbcdn.net/v/t39.30808-6/437937173_402735085851195_681068570261173560_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=5f2048&_nc_ohc=bBQeCtRv_AQAb5IwM-O&_nc_ht=scontent.fmel3-1.fna&oh=00_AfA9uae29VY1loBZX5g9yuynLCmf9xrqYMuuuBv37Ijxnw&oe=6626907B",
    "text": "Erima Village's new footbridge and health worker housing inaugurated.",
    "content": "Erima Village in the Astrolabe Bay Local Level Government (LLG) in Madang’s Rai Coast District, recently welcomed a new footbridge and Community Health Worker’s house funded by the Rai Coast District Development Authority.\n\nThe footbridge is a vital infrastructure that will make transportation of goods and services, and everyday commuting easier for locals. The area is geographically challenged with treacherous waterways and rivers that could swell significantly during the wet weather, making it impossible for people and even light vehicles to cross.\n\nMember for Rai Coast Kessy Sawang also opened a new house during the ceremony. The house will accommodate a Community Health Worker who serves in the local aid post in Erima. Council President Garry Kulunga called on his people to be equally responsible in taking care of the house, and that includes making sure the CHW and the infrastructure are safe, so that they can serve the sick.\n\nWard member Garry Kulunga called on his people to be equally responsible in taking care of the house, and that includes making sure the CHW and the infrastructure are safe, so that they can serve the sick.\n\nRai Coast District Health Manager Peter Omangem, in support of investing in the public health service, indicated that upgrading health services in Rai Coast is priority.\n\nMP Sawang has pledged to build another house for the health facility in Erima. It will bring the number of houses to three. She also said K60,000 will be given to a contractor to cement the foundations of the houses and build septic toilets for staff. \n\nShe also said she would look into upgrading the clinic itself in order to meet obligations set out in the MOU that was signed between the Madang PHA, the National Department of Health and the Rai Coast DDA. This includes the Madang PHA providing doctors and nurses to the district’s health facilities."
  },
  {
    "header": "Housing for Ileg police",
    "img": "https://scontent.fmel10-1.fna.fbcdn.net/v/t39.30808-6/438059367_402730149185022_5968645665648004035_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=5f2048&_nc_ohc=KUtaaRjcyoYAb51Ix4q&_nc_oc=Adjt0FWu1EnoZSEi5fPO1hwJV3j8z-0QfvvNbpCt7dy4-efjy_VjfgKD-nbDH695kSQ&_nc_ht=scontent.fmel10-1.fna&oh=00_AfD6joTt9LiycmV5MpY7BlhicCFuH5fRFrxhljnzybUEcA&oe=662791C9",
    "text": "New housing project announced for Ileg police by Rai Coast DDA.",
    "content": "Police officers at Ileg police station in Rai Coast District, Madang Province, are looking forward to receiving housing after being informed that the Rai Coast District Development Authority is building a house to accommodate law enforcers in Ileg. \n\nThe house will be built at Ileg Station in the Astrolabe Bay LLG.\n\nAstrolobe Bay LLG President Igu Fesom said lawlessness is rising in rural areas and he concerned that police manpower and moral is not sufficient to respond to this matter. \n\nFesom acknowledged local MP Kessy Swang and the Rai Coast DDA for taking into consideration the welfare of police officers, especially with housing, so that they can settle well and they can focus on their duty of addressing law and order issues.\n\nMadang Police Rural Commander Peter Gorek commended the police officers on the ground for their efforts in dealing with lawlessness, considering they work without reservists or auxiliaries. Commander Gorek expressed confidence in the DDA and the office of the MP in delivering more resources to local police to carry out their work effectively.\n\nMP Sawang said since taking office, she has spent K3 million on law and order alone. She has shifted her focus to providing vital resources to LLGs in Rai Coast where people’s lives are being marred by lawlessness.\n\nThe MP also said district funding being spent on addressing law and order issues cannot continue. She urged community leaders and the youth to come together and compromise for the sake of the wellbeing of the larger community. That way development and service can come in, including opportunities.\n\nMeantime, police are maintaining deployment into Astrolabe Bay LLG to keep law and order. "
  }
]